Revit 2024 API
BuiltInFailures.GeneralFailures.GenericCorruption Property
 A generic error has occurred.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId GenericCorruption { get; }
Visual Basic
Public Shared ReadOnly Property GenericCorruption As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ GenericCorruption {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.GeneralFailures Class
Autodesk.Revit.DB Namespace